app/controllers/tutors_controller.rb

SELECT "tutors".* FROM "tutors"
---
  def index
    @tutors = Tutor.all

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @tutor = Tutor.find(params[:id])

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @tutor = Tutor.find(params[:id])

INSERT INTO "tutors" ("created_at", "email", "name", "password_hash", "updated_at", "wepay_access_token", "wepay_account_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tutor = Tutor.new(params[:tutor])

    respond_to do |format|
      if @tutor.save